cask_args appdir: "/Applications", require_sha: true

brew "anthropic/claude/claude"
brew "bash"
brew "coreutils"
brew "curl"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "git-lfs"
brew "git"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "grep"
brew "libfido2"
brew "jq"
brew "mas" if OS.mac?
brew "mise"
brew "openssh"
brew "pinentry"
brew "postgresql@17"
brew "r"
brew "ripgrep"
brew "starship"
brew "syncthing"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "ykman"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "chatgpt"
cask "codex"
# cask "cursor"
# cask "datagrip"
# cask "docker"
cask "font-recursive-code"
# cask "inkscape"
cask "karabiner-elements"
cask "kitty"
# cask "microsoft-office-businesspro"
# cask "notion"
cask "orbstack"
# cask "postico"
cask "postman"
# cask "protonvpn"
# cask "rstudio"
# cask "session-manager-plugin"
# cask "slack"
# cask "tableplus"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
# cask "zoom"
cask "zotero"

# mas "1password", id: 1333542190
mas "bear", id: 1091189122
mas "yoink", id: 457622435
mas "copilot", id: 1447330651
mas "todoist", id: 585829637
